# structure = ["одна минута",
#             "две минуты",
#             "три минуты",

#             "двадцать две минуты",

#             "тридцать две минуты"
#     ] bad structure with duplicates

('одна', "одной", "один")
("две", "двух", "два")
("три", "трёх", "")
("четыре", "четырёх", "")
"пять"
"шесть"
"семь"
"восемь"
"девять"
"десять"
"одинадцать"
"двенадцать"
"тринадцать"
"четырнадцать"
"пятнадцать"
"шестнадцать"
"семнадцать"
"восемнадцать"
"девятнадцать"
("двадцать", "двадцати", "")
"тридцать"
"сорок"


"минут"
"часов"